# PLUGIN MADE BY @REBEL_IS_OP FOR REBELBOT
# KEEP CREDITS ELSE GAY

import random, re
from REBELBOT.utils import admin_cmd
import asyncio
from telethon import events
from userbot.cmdhelp import CmdHelp

@borg.on(admin_cmd(pattern="iloveyou ?(.*)"))
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit("""😘😘😘😘😘😘😘😘
😘😘😘😘😘😘😘😘
             😘😘😘
             😘😘😘
             😘😘😘
             😘😘😘
             😘😘😘
             😘😘😘
             😘😘😘
             😘😘😘 
             😘😘😘
😘😘😘😘😘😘😘😘
😘😘😘😘😘😘😘😘\n


😘😘
😘😘
😘😘
😘😘
😘😘
😘😘
😘😘
😘😘
😘😘😘😘😘😘😘😘
😘😘😘😘😘😘😘😘\n
⁭
           😘😘😘😘😘
      😘😘😘😘😘😘😘
   😘😘                       😘😘
 😘😘                          😘😘
😘😘                            😘😘
😘😘                            😘😘
 😘😘                           😘😘
   😘😘                       😘😘
       😘😘😘😘😘😘😘
            😘😘😘😘😘\n
⁭
😘😘                              😘😘
  😘😘                          😘😘
    😘😘                      😘😘
      😘😘                  😘😘
         😘😘             😘😘
           😘😘         😘😘
             😘😘     😘😘
               😘😘 😘😘
                  😘😘😘
                       😘\n
⁭
😘😘😘😘😘😘😘😘
😘😘😘😘😘😘😘😘
😘😘
😘😘
😘😘😘😘😘😘
😘😘😘😘😘😘
😘😘
😘😘
😘😘😘😘😘😘😘😘
😘😘😘😘😘😘😘😘\n

😘😘                         😘😘
  😘😘                    😘😘
     😘😘              😘😘
        😘😘        😘😘
           😘😘  😘😘
              😘😘😘
                😘😘
                😘😘
                😘😘
                😘😘
                😘😘\n
⁭
        😘😘😘😘😘😘
     😘😘😘😘😘😘😘
   😘😘                     😘😘
 😘😘                         😘😘
😘😘                           😘😘
😘😘                           😘😘
 😘😘                         😘😘
   😘😘                     😘😘
      😘😘😘😘😘😘😘
            😘😘😘😘😘\n
⁭
😘😘                      😘😘
😘😘                      😘😘
😘😘                      😘😘
😘😘                      😘😘
😘😘                      😘😘
😘😘                      😘😘
😘😘                      😘😘
  😘😘                  😘😘
      😘😘😘😘😘😘
            😘😘😘😘""")
            

CmdHelp("iloveyou").add_command(
  "iloveyou", "<enjoy>", "send your gf"
).add()